'''
组件的分类7大类23个
1、文本类组件5个：
    Label:标签组件。主要用于显示文本，添加提示信息等
    Entry:单行文本组件。只能添加单行文本，文本较多时，不能换行显示
    Text:多行文本组件。可以添加多行文本，文本较多时可以换行显示
    Spinbox:输入组件。可以理解为列表菜单与单行文本框的组合体,因为该组件既可以输入内容也可以直接从现有的选项中选择值
    Scale:数字范围组件。该组件可以使用户拖动滑块选择数值，类似于HTML5表单中的range

2、按钮类组件3个
    Button :按钮组件。通过单击按钮可以执行某些操作
    Radiobutton:单选组件。允许用户在众多选择中只能选中一个
    Checkbutton:复选框组件。允许用户多选

3、选择列表类组件4个
    Listbox:列表框组件。将众多选项整齐排列，供用户选择
    Scrollbar:滚动条组件。该组件可以绑定其他组件，使其他组件内容溢出时，显示滚动条
    OptionMenu:下拉列表
    Combobox:组合框。该组件为ttk模块中新增的组件。其功能与下拉列表类似，但是样式有所不同

4、容器类组件5个
    Frame:框架组件。用于将相关的组件放置在一起，以便于管理
    LabelFrame:标签框架组件。将相关的组件放置在一起，并给它们一个特定的名称
    Toplevel:顶层窗口。重新打开一个新窗口，该窗口显示在根窗口的上方
    PaneWindow;窗口布局管理。通过该组件可以手动修改其子组件的大小
    Notebook;选项卡。选择不同的内容，窗口中可显示对应的内容

5、会话类组件2个
    Message:消息框。为用户显示一些短消息，与Label类似，但是比Label更灵活
    Messagebox;对话框。该组件提供了8种不同场景的对话框

6、菜单类组件3个
    Menu:菜单组件。可以为窗口添加菜单项以及二级菜单
    Toolbar:工具栏。为窗口添加工具栏
    Treeview:树菜单

7、进度条组件1个
    Progressbar;添加进度条
'''

