#写一个    and 的返回值

"""
#1,优先级：1括号，2**乘方/根运算，3//取整,%取余, *,/取浮点型,  4，，+,-
"""
# 关系运算符： <、>、<=、>=、!=,==
# 运算符 功 能 优先级 示 例 结果及说明
#  ＝= 相等 4==0 False
#  ！= 不相等 4!=0
#  ”abc”!= ”abd” True (字符串比较完全一样时才相等)
#  < 小于 5<10 True
#  > 大于 ”abd”> ”abc” True (字符串比较，逐个字符比较)
#  <＝ 小于等于  20<＝20True(小于或等于)
#  >＝ 大于等于 ”abc”>＝”ad” False (字符”b”小于字符”d”)
#
#  优先级：先算术运算，再关系运算。
"""
# >>> ord('a')
# 97
# >>> ord('b')
# 98
# >>> 5+4>3
# True
# >>> 0 and False
# 0
# >>> v=[1,2,3,4,5,6,[1,2,3],'mark']
# >>> len(v)
# 8
# >>> v[1]
# 2
# >>> v.append(44)
# >>> v
# [1, 2, 3, 4, 5, 6, [1, 2, 3], 'mark', 44]
# >>> len(v)
# 9
# >>> v
# [1, 2, 3, 4, 5, 6, [1, 2, 3], 'mark', 44]
# >>> v[0]=11
# >>> v
# [11, 2, 3, 4, 5, 6, [1, 2, 3], 'mark', 44]
# >>> del v[0]
# >>> v
# [2, 3, 4, 5, 6, [1, 2, 3], 'mark', 44]
# >>> v.pop(1)
# 3
# >>> v
# [2, 4, 5, 6, [1, 2, 3], 'mark', 44]
# >>> '020广州，021上海，022天津，023重庆，024沈阳市，025南京

'.split('，')
SyntaxError: EOL while scanning string literal
#>>> '020广州，021上海，022天津，023重庆，024沈阳市，025南京'.split('，')
['020广州', '021上海', '022天津', '023重庆', '024沈阳市', '025南京']
"""
#
# def fun(a,b):
#     re = a
#     if re:          #为真执行，为假不执行
#         #就会继续判断b是否正确
#         re = b
#         return re
#     else:
#         return re
#
# if __name__ == '__main__':      #如果当前运行文件是这个文件，那么就执行下面的程序
#     v=fun(0,False)                    #用来判断a and b返回的结果。
#     print(v)

# city=['020广州', '021上海', '022天津', '023重庆', '024沈阳市', '025南京']
# num=input("请输入区号：")
# for i in city:
#     if num in i:
#         print(i)

while True:                 #重复执行
    week='一二三四五六日'
    n=eval(input("输入数字："))
    print(week[n-1])
#输入：1    输出：星期一