'''
'''
#1请打印     1，2，3，4，5，6，7，8，9，他们之间用'*'连接,如1*2*3*4*5*6*7*8*9   要求在同一行
print(1,2,3,4,5,6,7,8,9,sep="*")
print()
#print(self, *args, sep=' ', end='\n', file=None)   讲解
'''
# print('   春晓   ',end='   ')
# print('春眠不觉晓',end='   ')
# print('处处蚊子咬',end='   ')
# print('洒下敌敌畏',end='   ')
# print('不知死多少',end='   ')        #输出
# int(变量/数据)
# float(变量/数据)
# str(变量/数据)
# input(变量/数据)                     #输入
#input(123)          #第一步：显示提示信息  第二步：等待用户输入   第三步：把输入的内容以字符串的形式返回
#有一个会员登记系统，需要记录人名和电话存档，我设计一个简单的程序
# name=input("who are you")
# pn=input("your tp?")
# print(name,'的电话是：',pn,sep='')

练习编程题
#计算三角形的面积要求： (1)利用input()语句输入三角形的底和高，存入d,h；
#运用print()输出"三角形的底为：d,高为：h"     d和h是具体的数据

'''
#模拟测试2023  05一级题。