'''
序列解包的概念：
序列解包是 Python 中常用的一个功能，可以使用非常简洁的代码形式完成复杂的功能，提高代码的可读性，减少代码的输入量。多变量赋值：
>>> a , b , c =1,2,3
>>> a
1
>>> b
2
>>> c
3
#多变量赋值
>>> t = (1,2,3)
>>> x,y,z=t
>>> x
1
>>> y
2
>>> z
3
#对range()解包
>>> x,y,z = range(3)
>>> x
0
>>> y
1
>>> z
2

#对迭代器解包
>>> v = iter([1,2,3])
>>> a,b,c=v
>>> a
1
>>> b
2
>>> c
3

#对map对象解包：
>>> x,y,z = map(str,range(3))
>>> x
'0'
>>> y
'1'
>>> z
'2'

变量交换
a,b = b,a

序列解包还可以用于列表、字典、 enumerate对象、 filter对象、 zip 对象等。
对字典使用时默认是对字典的键进行操作，如果对”键：值”进行操作，应使用 items (）说明，
如果需要对字典值进行操作，应使用 values (）说明。
>>> a =[12,3]>>> Xy , Z = a
>>> X

#列表解包
>>> a,b,c = [2,3,4]
>>> a
2
>>> b
3
>>> c
4
>>> x,y,z=sorted([1,3,2])
>>> x
1
>>> y
2
>>> z
3

#字典解包
>>> d = {'a':1,'b':2,'c':3}
>>> x,y,z = d.items()
>>> x
('a', 1)
>>> y
('b', 2)
>>> z
('c', 3)
>>> d = {'a':1,'b':2,'c':3}
>>> x,y,z = d.values()
>>> x
1
>>> y
2
>>> z
3
>>> d
{'a': 1, 'b': 2, 'c': 3}
>>> x,y,z = d
>>> x
'a'
>>> y
'b'
>>> z
'c'

#字符串解包
>>> a,b,c = 'sky'
>>> a
's'
>>> b
'k'
>>> c
'y'
'''